# 3.数据过滤、排序与删除(Fliter & Sort  & Delete)                             


#### 笨办法学 Python 数据分析  / learn data analysis the hard way
- @Author：知行并重

|<h2>技能点</h2> | |
|:-----|:-----|
|**Q029: 根据行号选取数据**|**Q030: 根据列号选取数据**|
|**Q031: 按照条件选取数据**|
|**Q032: 选取所有数值型列的数据**|**Q033: 选取所有类别型列的数据**|
|**Q034: 根据某列进行升降排序**|**Q035: 根据多列分别进行升级排序**|
|**Q036: 根据某列生成序号**|**Q037: 根据多列生成序号**|
|**Q038: 基于指定列中统计数据重复数量**|**Q039: 在指定列中统计数据非重复数量**|
|**Q040: 筛选出重复部分数据**|**Q041: 剔除指定列中重复数据**|
|**Q042: 从数据中删除部分行列**|**Q043: 从内存中删除数据变量**|
|**Q044: 将索引列转化成数据中的一列**|**Q045: 将数据中的某列设置为索引列**|

### Step1: 导入必要的库

In [29]:
import pandas as pd #数据分析
import numpy as np #矩阵计算

data = pd.read_csv("../input/titanic.csv")

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 一、 数据选取

### Q029: 根据行号选取数据


 选取第500行-600行后的数据

In [31]:
# temp = data[500:600]

temp = data.iloc[500:600,:]
print(temp.shape)
temp.tail()

(100, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
595,596,0,3,"Van Impe, Mr. Jean Baptiste",male,36.0,1,1,345773,24.1500,NaN,S
596,597,1,2,"Leitch, Miss. Jessie Wills",female,NaN,0,0,248727,33.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,1,0,PC 17485,56.9292,A20,C

### Q030: 根据列号选取数据
选取500行以后且第3列之后数据

采用 `DataFrame.iloc` 按照索引位置选取

In [32]:
temp = data.iloc[500:,3:]
temp.head()

,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
500,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
501,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
502,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
503,"Laitinen, Miss. Kristina Sofia",female,37.0,0,0,4135,9.5875,NaN,S
504,"Maioni, Miss. Roberta",female,16.0,0,0,110152,86.5000,B79,S

### Q031: 按照条件选取数据

例如选取 'Survived', 'Ticket' 两列

In [33]:
temp = data[['Survived', 'Ticket']]
temp.head()

   Survived            Ticket
0         0         A/5 21171
1         1          PC 17599
2         1  STON/O2. 3101282
3         1            113803
4         0            373450

#### 选取Embarked = S 的数据

按条件选取数据，最新的pandas接口 采用 `DataFrame.loc` 方法 .
[官方文档](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html?highlight=loc#pandas.DataFrame.loc)

In [35]:
temp = data.loc[data['Embarked']=='S',:]
temp.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

#### 选取Embarked = S 且 SibSp =1 的样本PassengerId 和 Survived数据

In [36]:
temp = data.loc[(data['Embarked']=='S')&(data['SibSp']==1),['PassengerId','Survived','Embarked','SibSp']]  #'Embarked','SibSp'
temp.head()

    PassengerId  Survived Embarked  SibSp
0             1         0        S      1
3             4         1        S      1
10           11         1        S      1
13           14         0        S      1
18           19         0        S      1

#### 选取Cabin 在cabin_list的所有数据

- cabin_list =['C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37', 'C30', 'D20']

In [37]:
cabin_list =['C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37', 'C30', 'D20']

In [38]:
temp = data.loc[data['Cabin'].isin(cabin_list),:]
temp.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
453,454,1,1,"Goldenberg, Mr. Samuel L",male,49.0,1,0,17453,89.1042,C92,C
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
457,458,1,1,"Kenyon, Mrs. Frederick R (Marion)",female,NaN,1,0,17464,51.8625,D21,S
460,461,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S
462,463,0,1,"Gee, Mr. Arthur H",male,47.0,0,0,111320,38.5000,E63,S

#### 选取Cabin <font color=red>不在</font>cabin_list的所有数据

In [39]:
temp = data.loc[~data['Cabin'].isin(cabin_list),:]

temp.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

### Q032: 选取所有数值型列的数据 
1.3 按照类型选取数据

In [40]:
#　 查看数值型特征
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### 选取所有数值型特征数据

In [41]:
num_data = data.select_dtypes(include = ['float64','int64'])
num_data.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

### Q033: 选取所有类别型列的数据

In [42]:
num_data = data.select_dtypes(include = ['object'])
num_data.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [43]:
data.select_dtypes??

## 二、排序

### Q034: 根据某列进行升降排序

例如 对Age进行倒序排列

In [44]:
temp = data.sort_values(by =['Age'],ascending =False)  #  默认升序
temp.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

In [ ]:
# 排序后可以 直接赋值回去 
data.sort_values(by =['Age'],ascending =False,inplace=True)
# data = data.sort_values(by =['Age'],ascending =False)

In [45]:
data.sort_values??

### Q035: 根据多列分别进行升级排序

#### 对'Age','Pclass' 进行排倒序

In [23]:
temp = data.sort_values(by = ['Age','Pclass'],ascending = False)
temp.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

In [ ]:
data.sort_values??

In [24]:
# 如果我们想对，Age 降序， 同时 Pclass 升序，如何实现？
temp = data.sort_values(by = ['Age','Pclass'],ascending = [False, True])
temp.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S

### Q036: 根据某列生成序号

利用rank() 方法排序(掌握) 。
返回对应数据的序号。体会不同参数的区别 method : {'average', 'min', 'max', 'first', 'dense'}

In [49]:
temp = data[['Age']].sample(10,random_state=10)
pd.DataFrame.rank??
# 其中 ascending=False 参数，设置正序还是反序

In [47]:
temp['age_rank_min'] = temp['Age'].rank(method='min')
temp['age_rank_max'] = temp['Age'].rank(method='max')
temp['age_rank_dense'] = temp['Age'].rank(method='dense')

In [12]:
pd.DataFrame.rank??

In [48]:
temp.sort_values('Age')

      Age  age_rank_min  age_rank_max  age_rank_dense
646  19.0           1.0           1.0             1.0
131  20.0           2.0           2.0             2.0
287  22.0           3.0           3.0             3.0
75   25.0           4.0           4.0             4.0
628  26.0           5.0           5.0             5.0
569  32.0           6.0           6.0             6.0
590  35.0           7.0           8.0             7.0
230  35.0           7.0           8.0             7.0
586  47.0           9.0           9.0             8.0
195  58.0          10.0          10.0             9.0

### Q037: 根据多列生成序号

In [59]:
temp = data[['Age','Pclass']].sample(10,random_state=10)
temp.sort_values(['Age','Pclass'],inplace=True)

In [60]:
temp

      Age  Pclass
646  19.0       3
131  20.0       3
287  22.0       3
75   25.0       3
628  26.0       3
569  32.0       3
230  35.0       1
590  35.0       3
586  47.0       2
195  58.0       1

In [63]:
temp['rank_two_col'] = temp.apply(tuple,axis=1) \
             .rank(method='dense').astype(int)
# tuple 为元组 （871,12）

In [64]:
temp.head(15)

      Age  Pclass  rank_two_col
646  19.0       3             1
131  20.0       3             2
287  22.0       3             3
75   25.0       3             4
628  26.0       3             5
569  32.0       3             6
230  35.0       1             7
590  35.0       3             8
586  47.0       2             9
195  58.0       1            10


若想要解决 根据的不同班级的学生成绩，在班级内的排名的问题

可结合groupby 聚合班级后，再使用rank，这个我们放在 第六章 聚合 中介绍。

## 三、去重

### Q038: 基于指定列 统计数据重复数量

计算 数据中不同性别和年龄 ['Sex','Age'] 重复数据量

In [69]:
sub_data = data[['Sex','Age']]

In [70]:
sub_data.head()

      Sex   Age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0

In [71]:
# 运用 `DataFrame.duplicated` 方法
sub_data.duplicated().sum()

744

In [72]:
sub_data.shape

(891, 2)

### Q039: 在指定列中统计数据非重复数量

In [73]:
dup_num = len(data) - sub_data.duplicated().sum()
dup_num

147

### Q040: 筛选出重复部分数据

In [74]:
sub_data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887     True
888     True
889     True
890     True
Length: 891, dtype: bool

In [75]:
sub_data[sub_data.duplicated()]

        Sex   Age
14   female  14.0
16     male   2.0
17     male   NaN
20     male  35.0
25   female  38.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[744 rows x 2 columns]

### Q041: 剔除指定列中重复数据
 剔除  'Sex','Age' 的重复数据 temp

运用 `pd.DataFrame.drop_duplicates` 方法

In [76]:

temp = data.drop_duplicates([ 'Sex','Age' ],keep = 'first') # 先排序 后 去重
# sub_data.drop_duplicates(['Age'],keep = 'last',inplace =False)

temp.shape

(147, 12)

### Q042: 从数据中删除部分行列

#### 删除第2-5行

In [78]:
temp  = data.drop(index=[1,2,3,4])  # python 从 0 开始
temp.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

#### 删除Name、Sex两列

In [79]:
temp  = data.drop(columns=['Name','Sex'])  # python 从 0 开始
temp.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,35.0,0,0,373450,8.0500,NaN,S

### Q043: 从内存中删除数据变量

In [80]:
# 1. 一般的数据删除操作。
del sub_data;

In [81]:
import gc
gc.collect() # 强制垃圾回收

103

## 四、索引操作

### Q044: 将索引列转化成数据中的一列
将temp索引 变为列

In [82]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [83]:
data.reset_index(inplace=True)
data.head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Q045: 将数据中的某列设置为索引列

将data的 PassengerId 列 变设置为索引

In [84]:
temp.set_index('PassengerId',inplace = True)
temp.head(3)

,Survived,Pclass,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,
1,0,3,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

其他关于索引的操作 比如多重索引的选取操作，后续再谈

# 谢谢观看
Github 代码：https://github.com/kevin-meng/learn-data-analysis-the-hard-way

![](../pics/thankyou.png)